src/bp.volna.cfu/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорректироватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КорректироватьБУиНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДСДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаДоИзменения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp.volna.cfu/Enums/ВидыОперацийРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОперацийРеализацияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгрузкаБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bp.volna.cfu/Documents/КорректировкаРеализации/Ext/ObjectModule.bsl
&После("ОбработкаПроведения")
Процедура влн_ОбработкаПроведения(Отказ, РежимПроведения)
	// Вставить содержимое метода.
	Если (ЭтотОбъект.РучнаяКорректировка) Тогда
		Возврат;
	КонецЕсли;
	
	Если (ЭтотОбъект.КорректироватьНДС) И (НЕ ЭтотОбъект.КорректироватьБУиНУ) И (ЭтотОбъект.ДокументРеализации.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ОтгрузкаБезПереходаПраваСобственности) Тогда
		
		Счет6201  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01");
		Счет90011 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.01.1");
		Счет9003  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.03");
		Счет1909  = ПланыСчетов.Хозрасчетный.НайтиПоКоду("19.09");
		
		структураОбщая = Новый Структура();
		структураОбщая.Вставить("Период", ЭтотОбъект.Дата);
		структураОбщая.Вставить("Организация", ЭтотОбъект.Организация);
		
		Для Каждого стр из ЭтотОбъект.Товары Цикл
			суммаНДС = стр.СуммаНДС - стр.СуммаНДСДоКорректировки;
			суммаСНДС = стр.Сумма - стр.СуммаДоКорректировки;
			
			запись = ЭтотОбъект.Движения.Хозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(запись,структураОбщая);
			
			запись.Сумма = суммаСНДС;
			запись.СуммаНУДт = суммаСНДС;
			//запись.СуммаПРДт = запись.Сумма -запись.СуммаНУДт;
			запись.СуммаНУКт = суммаСНДС - суммаНДС ;
			//запись.СуммаПРКт = запись.Сумма -запись.СуммаНУКт;
			
			запись.СчетДт = Счет6201;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,1, ЭтотОбъект.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,2, ЭтотОбъект.ДоговорКонтрагента);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,3, ЭтотОбъект.ДокументРеализации);			
			запись.СчетКт = Счет90011;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,1, стр.Номенклатура.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,2, стр.СтавкаНДС);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,3, стр.Номенклатура);
			
			
			запись = ЭтотОбъект.Движения.Хозрасчетный.Добавить();
			ЗаполнитьЗначенияСвойств(запись,структураОбщая);
			
			запись.СчетДт = Счет9003;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,1, стр.Номенклатура.НоменклатурнаяГруппа);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетДт,запись.СубконтоДт,2, стр.СтавкаНДС);
			запись.СчетКт = Счет1909;			
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,1, ЭтотОбъект.Контрагент);
			БухгалтерскийУчет.УстановитьСубконто(запись.СчетКт,запись.СубконтоКт,2, ЭтотОбъект.ДокументРеализации);
			
			запись.Сумма = суммаНДС;
			запись.СуммаНУДт = 0;
			//запись.СуммаПРДт = запись.СуммаНУДт - запись.Сумма;
			запись.СуммаНУКт = 0;
			//запись.СуммаПРКт = запись.СуммаНУКт - запись.Сумма;

		КонецЦикла;
	КонецЕсли;
	ЭтотОбъект.Движения.Хозрасчетный.Записать();
КонецПроцедуры
